[
    {
       "name":"Best Fluffy Pancakes" ,
       "image":"https://www.allrecipes.com/thmb/tOfkDV1xc28JMmITPQlQwy3FNWs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/21014-Good-old-Fashioned-Pancakes-mfs_001-1fa26bcdedc345f182537d95b6cf92d8.jpg",
       "dish-type":"main",
       "meal":"breakfast",
       "diet":[
        "vegetarian",
        "gluten-free",
        "pescaterian",
        "keto"
       ],
       "ingredients": {
        "plain flour":"290g" ,
        "sugar":"60g",
        "baking powder":"4 teaspoons",
        "baking soda":"1/4 teaspoons",
        "salt":"1/2 teaspoon",
        "milk":"1 3/4 cups",
        "butter":"1/4 cup",
        "pure vanilla extract":"2 teaspoons",
        "egg":"1 large"
       },
       "instructions":{
        "Step 1":"Combine together the flour, sugar (or sweetener), baking powder, baking soda and salt in a large-sized bowl. Make a well in the centre and add the milk, slightly cooled melted butter, vanilla and egg",
        "Step 2":"Use a wire whisk to whisk the wet ingredients together first before slowly folding them into the dry ingredients. Mix together until smooth (there may be a couple of lumps but that's okay).",
        "Step 3":"Set the batter aside and allow to rest while heating up your pan or griddle.",
        "Step 4":"Heat a nonstick pan or griddle over low-medium heat and wipe over with a little butter to lightly grease pan. Pour ¼ cup of batter onto the pan and spread out gently into a round shape with the back of your ladle or measuring cup.",
        "Step 5":"When the underside is golden and bubbles begin to appear on the surface, flip with a spatula and cook until golden. Repeat with remaining batter.",
        "Step 6":"Serve with honey, maple syrup, fruit, ice cream or frozen yoghurt, or enjoy plain!"
       }
    },
    {
       "name":"Homemade Crepes" ,
       "image":"https://www.allrecipes.com/thmb/VR-7_dO2ksjeSNAoW_mdj1XkJRY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/4511555-dessert-crepes-Buckwheat-Queen-1x1-1-90b5c7ed132f47728b8a2fdc1c984dd0.jpg",
       "dish-type":"main",
       "meal":"breakfast",
       "diet":[
        "vegetarian",
        "gluten-free",
        "pescaterian",
        "keto"
       ],
       "ingredients": {
        "plain flour":"125g" ,
        "sugar":"1 tablespoon",
        "salt":"1/8 teaspoon",
        "milk":"180ml",
        "pure vanilla extract":"1 1/2",
        "water":"120ml",
        "egg":"2 large"
       },
       "instructions":{
        "Step 1":"Melt 3 Tablespoons of butter in the microwave or on the stove. Cool for about 5 minutes before using in the next step. The remaining butter is for the skillet.",
        "Step 2":"Combine the cooled melted butter, flour, sugar, salt, milk, water, eggs, and vanilla to a blender or large food processor.  If you do not have a blender or food processor, use a large mixing bowl and whisk by hand. Blend on medium-high speed for 20-30 seconds until everything is combined. The mixture will be silky smooth and the consistency of cream. Cover the blender tightly or pour into a medium bowl, cover tightly, and chill in the refrigerator for 30-60 minutes and up to 1 day. (After refrigerating, if the batter looks separated, give it a quick stir before cooking in the next step.)",
        "Step 3":"Cook the crepes: Use the remaining butter for greasing the pan between each crepe. Place an 8-inch skillet over medium heat and generously grease it with some of the reserved butter. If you do not have a skillet this size, use a larger one but make sure you keep the crepes thin. Once the skillet is hot, pour 3-4 Tablespoons (closer to 3 is best) of batter into the center of the pan. Tilt/twirl the pan so the batter stretches as far as it will go. The thinner the crepe, the better the texture. Cook for 1-2 minutes, then flip as soon as the bottom is set. Do not wait too long to flip crepes or else they will taste rubbery. Cook the other side for 30 seconds until set. Transfer the cooked crepe to a large plate and repeat with the remaining batter, making sure to butter the pan between each crepe. If desired, separate each crepe with parchment paper so they do not stick together. Though, if using enough butter in your pan, the crepes will stick",
        "Step 4":"Fill the crepes. I love serving them warm, but they are excellent at room temperature too. See my filling suggestions above this recipe or my recipe notes below. Place a few spoonfuls of your filling ingredient(s) in the center of the crepe. Fold both sides over the filling. Crepes are delicious with toppings, too, such as a drizzle of melted chocolate, melted peanut butter, or a dusting of confectioners sugar. Or a savory sauce like pesto or hollandaise.",
        "Step 5":"Leftover unfilled crepes remain fresh in an airtight container in the refrigerator for 1 day or in the freezer for 1 month. Freeze each between small sheets of parchment paper so they don’t stick. (I usually layer them with parchment and freeze in a large zipped-top bag.) Thaw at room temperature before filling/enjoying. See reheating instructions in my Make Ahead Instructions recipe note below."
       }
    },
    {
       "name":"Bibimbap" ,
       "image":"228240-BibimbapKoreanRiceWithMixedVegtables-ddmfs-4X3-0667-70784fdd28904e2daab245c029f978ee.webp",
       "dish-type":"main",
       "meal":[
        "lunch",
        "dinner"
       ],
       "diet":[
        "vegetarian",
        "gluten-free",
        "pescaterian",
        "keto",
        "DASH"
       ],
       "ingredients": {
        "cooked short-grain rice":"5 cups " ,
        "soy bean sprouts":"12 ounces",
        "spinach blanched ":"8 ounces",
        "carrot":"1 large",
        "red bell pepper":"1 large",
        "zucchini":"1 large",
        "English cucumber":"1",
        "green onions":"3 to 4, chopped",
        "fresh lean cut of beef":"½ pound",
        "fernbrake (gosari)":"4 ounces",
        "dried bellflower roots (doraji)":"1 ounce, soaked in cold water for 18 to 24 hours",
        "eggs":"4",
        "kosher salt":"",
        "vegetable oil":"",
        "toasted sesame oil":"",
        "toasted sesame seeds":"",
        "garlic":"",
        "soy sauce":"",
        "honey (or sugar)":"",
        "Korean hot pepper paste (gochujang)":""
       },
       "instructions":{
        "Step 1":"Clean vegtables",
        "Step 2":"cut carrots, zucchini, cucumber, and bell peppers ",
        "Step 3":"Marinate and cook the beef and eggs",
        "Step 4":"saute and seasoon carrots, zucchini, cucumber and bell peppers",
        "Step 5":"Assemble and firmly mix. Enjoy!"
       }
    }
]